OpenPuya/PY32T020_Firmware/Drivers/PY32T020_HAL_Driver/Inc/py32t020_hal_uart.h
  __IO uint16_t                 TxXferCount;      /*!< UART Tx Transfer Counter           */

  uint8_t                       *pRxBuffPtr;      /*!< Pointer to UART Rx transfer Buffer */

  uint16_t                      RxXferSize;       /*!< UART Rx Transfer size              */

  __IO uint16_t                 RxXferCount;      /*!< UART Rx Transfer Counter           */

  HAL_LockTypeDef               Lock;             /*!< Locking object                     */

  __IO HAL_UART_StateTypeDef    gState;           /*!< UART state information related to global Handle management
                                                       and also related to Tx operations.
                                                       This parameter can be a value of @ref HAL_UART_StateTypeDef */

  __IO HAL_UART_StateTypeDef    RxState;          /*!< UART state information related to Rx operations.
                                                       This parameter can be a value of @ref HAL_UART_StateTypeDef */

  __IO uint32_t                 ErrorCode;        /*!< UART Error code                    */

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  void (* TxCpltCallback)(struct __UART_HandleTypeDef *huart);            /*!< UART Tx Complete Callback             */
  void (* RxCpltCallback)(struct __UART_HandleTypeDef *huart);            /*!< UART Rx Complete Callback             */
  void (* ErrorCallback)(struct __UART_HandleTypeDef *huart);             /*!< UART Error Callback                   */
  void (* AbortCpltCallback)(struct __UART_HandleTypeDef *huart);         /*!< UART Abort Complete Callback          */
  void (* AbortTransmitCpltCallback)(struct __UART_HandleTypeDef *huart); /*!< UART Abort Transmit Complete Callback */
  void (* AbortReceiveCpltCallback)(struct __UART_HandleTypeDef *huart);  /*!< UART Abort Receive Complete Callback  */
  void (* BreakFrameCallback)(struct __UART_HandleTypeDef *huart);        /*!< UART Break Frame Detection Callback  */
  void (* AddrMatchCallback)(struct __UART_HandleTypeDef *huart);         /*!< UART Address Match Callback  */

  void (* MspInitCallback)(struct __UART_HandleTypeDef *huart);           /*!< UART Msp Init callback                */
  void (* MspDeInitCallback)(struct __UART_HandleTypeDef *huart);         /*!< UART Msp DeInit callback              */
#endif  /* USE_HAL_UART_REGISTER_CALLBACKS */

} UART_HandleTypeDef;

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL UART Callback ID enumeration definition
  */
typedef enum
{
  HAL_UART_TX_COMPLETE_CB_ID             = 0x00U,    /*!< UART Tx Complete Callback ID             */
  HAL_UART_RX_COMPLETE_CB_ID             = 0x01U,    /*!< UART Rx Complete Callback ID             */
  HAL_UART_ERROR_CB_ID                   = 0x02U,    /*!< UART Error Callback ID                   */
  HAL_UART_ABORT_COMPLETE_CB_ID          = 0x03U,    /*!< UART Abort Complete Callback ID          */
  HAL_UART_ABORT_TRANSMIT_COMPLETE_CB_ID = 0x04U,    /*!< UART Abort Transmit Complete Callback ID */
  HAL_UART_ABORT_RECEIVE_COMPLETE_CB_ID  = 0x05U,    /*!< UART Abort Receive Complete Callback ID  */
  HAL_UART_BREAK_FRAME_CB_ID             = 0x06U,    /*!< UART Break Frame Detection Callback ID  */
  HAL_UART_ADDR_MATCH_CB_ID              = 0x07U,    /*!< UART Address Match Callback ID  */

  HAL_UART_MSPINIT_CB_ID                 = 0x0BU,    /*!< UART MspInit callback ID                 */
  HAL_UART_MSPDEINIT_CB_ID               = 0x0CU     /*!< UART MspDeInit callback ID               */

} HAL_UART_CallbackIDTypeDef;

/**
  * @brief  HAL UART Callback pointer definition
  */
typedef  void (*pUART_CallbackTypeDef)(UART_HandleTypeDef *huart);  /*!< pointer to an UART callback function */

#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup UART_Exported_Constants UART Exported Constants
  * @{
  */

/** @defgroup UART_Error_Code UART Error Code
  * @{
  */
#define HAL_UART_ERROR_NONE              0x00000000U   /*!< No error            */
#define HAL_UART_ERROR_ORE               0x00000001U   /*!< Overrun error        */
#define HAL_UART_ERROR_PE                0x00000002U   /*!< Parity error         */
#define HAL_UART_ERROR_FE                0x00000004U   /*!< Frame error         */
#define HAL_UART_ERROR_BUSY              0x00000008U   /*!< BUSY error      */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
#define  HAL_UART_ERROR_INVALID_CALLBACK 0x00000020U   /*!< Invalid Callback error  */
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup UART_Word_Length UART Word Length
  * @{
  */
#define UART_WORDLENGTH_5B                  0x00000000U
#define UART_WORDLENGTH_6B                  ((uint32_t)UART_CR1_M_0)
#define UART_WORDLENGTH_7B                  ((uint32_t)UART_CR1_M_1)
#define UART_WORDLENGTH_8B                  ((uint32_t)(UART_CR1_M_1) | (UART_CR1_M_0))
#define UART_WORDLENGTH_9B                  0xFFFFFFFFU
/**
  * @}
  */
  
/** @defgroup UART_Stop_Bits UART Number of Stop Bits
  * @{
  */
#define UART_STOPBITS_1                     0x00000000U
#define UART_STOPBITS_1_5_OR_2              ((uint32_t)UART_CR1_STOP)
/**
  * @}
  */

/** @defgroup UART_Parity UART Parity
  * @{
  */
#define UART_PARITY_NONE         0x00000000U
#define UART_PARITY_EVEN         ((uint32_t)(UART_CR1_PCE | UART_CR1_PS))
#define UART_PARITY_ODD          ((uint32_t)UART_CR1_PCE)
#define UART_PARITY_STICKY_0     ((uint32_t)(UART_CR1_PCE | UART_CR1_SP | UART_CR1_PS))
#define UART_PARITY_STICKY_1     ((uint32_t)(UART_CR1_PCE | UART_CR1_SP))
/**
  * @}
  */

/** @defgroup UART_Msb_First UART MSB First
  * @{
  */
#define UART_MSB_FIRST_DISABLE         0x00000000U
#define UART_MSB_FIRST_ENABLE          ((uint32_t)UART_CR1_MSBFIRST)
/**
  * @}
  */
  
/** @defgroup UART_Tx_Mode UART transmit mode
  * @{
  */
#define UART_TX_MODE_0         0x00000000U
#define UART_TX_MODE_1         ((uint32_t)UART_CR3_TX_MODE)
/**
  * @}
  */

/** @defgroup UART_Rx_Mode UART receive mode
  * @{
  */
#define UART_RX_ADDR_MATCH_SOFT         0x00000000U
#define UART_RX_ADDR_MATCH_HARD         ((uint32_t)UART_CR3_ADDR_MATCH)
/**
  * @}
  */

/** @defgroup UART_Flags   UART FLags
  *        Elements values convention: 0xXXXX
  *           - 0xXXXX  : Flag mask in the SR register
  * @{
  */
#define UART_FLAG_BUSY_ERR                  ((uint32_t)UART_SR_BUSY_ERR)
#define UART_FLAG_BUSY                      ((uint32_t)UART_SR_BUSY)
#define UART_FLAG_ADDR_RCVD                 ((uint32_t)UART_SR_ADDR_RCVD)
#define UART_FLAG_TXE                       ((uint32_t)UART_SR_TXE)
#define UART_FLAG_TDRE                      ((uint32_t)UART_SR_TDRE)
#define UART_FLAG_BRI                       ((uint32_t)UART_SR_BRI)
#define UART_FLAG_FE                        ((uint32_t)UART_SR_FE)
#define UART_FLAG_PE                        ((uint32_t)UART_SR_PE)
#define UART_FLAG_ORE                       ((uint32_t)UART_SR_ORE)
#define UART_FLAG_RXNE                      ((uint32_t)UART_SR_RXNE)
/**
  * @}
  */

/** @defgroup UART_Interrupt_definition  UART Interrupt Definitions
  *        Elements values convention: 0xXXXX
  *           - XXXX  : Interrupt mask in the CR2 register
  * @{
  */
#define UART_IT_BUSY_ERR                     ((uint32_t)UART_CR2_BUSYERRIE)
#define UART_IT_LS                           ((uint32_t)UART_CR2_LSIE)
#define UART_IT_TDRE                         ((uint32_t)UART_CR2_TDREIE)
#define UART_IT_RXNE                         ((uint32_t)UART_CR2_RXNEIE)
/**
  * @}
  */
  
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup UART_Exported_Macros UART Exported Macros
  * @{
  */

/** @brief Reset UART handle gstate & RxState
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the UARTx peripheral
  *         (UART availability and x values depending on device).
  * @retval None
  */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
#define __HAL_UART_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                       (__HANDLE__)->gState = HAL_UART_STATE_RESET;      \
                                                       (__HANDLE__)->RxState = HAL_UART_STATE_RESET;     \
                                                       (__HANDLE__)->MspInitCallback = NULL;             \
                                                       (__HANDLE__)->MspDeInitCallback = NULL;           \
                                                     } while(0U)
#else
#define __HAL_UART_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                       (__HANDLE__)->gState = HAL_UART_STATE_RESET;      \
                                                       (__HANDLE__)->RxState = HAL_UART_STATE_RESET;     \
                                                     } while(0U)
#endif /*USE_HAL_UART_REGISTER_CALLBACKS */

/** @brief  Flushes the UART DR register
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the UARTx peripheral
  *         (UART availability and x values depending on device).
  */
#define __HAL_UART_FLUSH_DRREGISTER(__HANDLE__) ((__HANDLE__)->Instance->DR)

